## Plan Result (prod-shutter)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 11 to add, 0 to change, 11 to destroy.</code></pre>

* Create
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;court-tribunal-hearings&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;jd-bureau&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;jd-reply-jury-summons&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;pip-frontend&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;sds-api-mgmt&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;vh-admin-web&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;vh-video-web&#34;]
* Delete
  * module.shutter.azurerm_cdn_endpoint.shutter_endpoint[&#34;vh-test-web&#34;]
  * module.shutter.azurerm_cdn_endpoint.shutter_endpoint[&#34;vh-wowza&#34;]
  * module.shutter.azurerm_cdn_endpoint_custom_domain.this[&#34;vh-test-web&#34;]
  * module.shutter.azurerm_cdn_profile.main[&#34;vh-test-web&#34;]
  * module.shutter.azurerm_cdn_profile.main[&#34;vh-wowza&#34;]
  * module.shutter.azurerm_storage_account.shutter_store[&#34;vh-test-web&#34;]
  * module.shutter.azurerm_storage_account.shutter_store[&#34;vh-wowza&#34;]
* Replace
  * module.shutter.azurerm_cdn_endpoint.shutter_endpoint[&#34;vh-admin-web&#34;]
  * module.shutter.azurerm_cdn_endpoint.shutter_endpoint[&#34;vh-video-web&#34;]
  * module.shutter.azurerm_cdn_endpoint_custom_domain.this[&#34;vh-admin-web&#34;]
  * module.shutter.azurerm_cdn_endpoint_custom_domain.this[&#34;vh-video-web&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.shutter.azurerm_cdn_endpoint.shutter_endpoint["vh-admin-web"] must be replaced
-/+ resource "azurerm_cdn_endpoint" "shutter_endpoint" {
      ~ content_types_to_compress     = [] -> (known after apply)
      ~ fqdn                          = "hmcts-vh-admin-web-shutter-prod.azureedge.net" -> (known after apply)
      ~ id                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/sds-platform-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-shutter-vh-admin-web/endpoints/hmcts-vh-admin-web-shutter-prod" -> (known after apply)
      ~ name                          = "hmcts-vh-admin-web-shutter-prod" -> "hmcts-admin-sds-shutter-prod" # forces replacement
      + origin_path                   = (known after apply)
      + probe_path                    = (known after apply)
        tags                          = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.shutter.azurerm_cdn_endpoint.shutter_endpoint["vh-test-web"] will be destroyed
  - resource "azurerm_cdn_endpoint" "shutter_endpoint" {
      - content_types_to_compress     = [] -> null
      - fqdn                          = "hmcts-vh-test-web-shutter-prod.azureedge.net" -> null
      - id                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/sds-platform-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-shutter-vh-test-web/endpoints/hmcts-vh-test-web-shutter-prod" -> null
      - is_compression_enabled        = false -> null
      - is_http_allowed               = false -> null
      - is_https_allowed              = true -> null
      - location                      = "westus" -> null
      - name                          = "hmcts-vh-test-web-shutter-prod" -> null
      - origin_host_header            = "hmctsvhtestweshutterprod.z33.web.core.windows.net" -> null
      - profile_name                  = "hmcts-shutter-vh-test-web" -> null
      - querystring_caching_behaviour = "IgnoreQueryString" -> null
      - resource_group_name           = "sds-platform-prod-rg" -> null
      - tags                          = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/sds-azure-platform"
          - "businessArea" = "Cross-Cutting"
          - "criticality"  = "High"
          - "environment"  = "production"
        } -> null

      - origin {
          - host_name  = "hmctsvhtestweshutterprod.z33.web.core.windows.net" -> null
          - http_port  = 80 -> null
          - https_port = 443 -> null
          - name       = "hmctsvhtestweshutterprod-z33-web-core-windows-net" -> null
        }
    }

  # module.shutter.azurerm_cdn_endpoint.shutter_endpoint["vh-video-web"] must be replaced
-/+ resource "azurerm_cdn_endpoint" "shutter_endpoint" {
      ~ content_types_to_compress     = [] -> (known after apply)
      ~ fqdn                          = "hmcts-vh-video-web-shutter-prod.azureedge.net" -> (known after apply)
      ~ id                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/sds-platform-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-shutter-vh-video-web/endpoints/hmcts-vh-video-web-shutter-prod" -> (known after apply)
      ~ name                          = "hmcts-vh-video-web-shutter-prod" -> "hmcts-video-sds-shutter-prod" # forces replacement
      + origin_path                   = (known after apply)
      + probe_path                    = (known after apply)
        tags                          = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.shutter.azurerm_cdn_endpoint.shutter_endpoint["vh-wowza"] will be destroyed
  - resource "azurerm_cdn_endpoint" "shutter_endpoint" {
      - content_types_to_compress     = [] -> null
      - fqdn                          = "hmcts-vh-wowza-shutter-prod.azureedge.net" -> null
      - id                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/sds-platform-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-shutter-vh-wowza/endpoints/hmcts-vh-wowza-shutter-prod" -> null
      - is_compression_enabled        = false -> null
      - is_http_allowed               = false -> null
      - is_https_allowed              = true -> null
      - location                      = "westus" -> null
      - name                          = "hmcts-vh-wowza-shutter-prod" -> null
      - origin_host_header            = "hmctsvhwowzashutterprod.z33.web.core.windows.net" -> null
      - profile_name                  = "hmcts-shutter-vh-wowza" -> null
      - querystring_caching_behaviour = "IgnoreQueryString" -> null
      - resource_group_name           = "sds-platform-prod-rg" -> null
      - tags                          = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/sds-azure-platform"
          - "businessArea" = "Cross-Cutting"
          - "criticality"  = "High"
          - "environment"  = "production"
        } -> null

      - origin {
          - host_name  = "hmctsvhwowzashutterprod.z33.web.core.windows.net" -> null
          - http_port  = 80 -> null
          - https_port = 443 -> null
          - name       = "hmctsvhwowzashutterprod-z33-web-core-windows-net" -> null
        }
    }

  # module.shutter.azurerm_cdn_endpoint_custom_domain.this["vh-admin-web"] must be replaced
-/+ resource "azurerm_cdn_endpoint_custom_domain" "this" {
      ~ cdn_endpoint_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/sds-platform-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-shutter-vh-admin-web/endpoints/hmcts-vh-admin-web-shutter-prod" -> (known after apply) # forces replacement
      ~ host_name       = "vh-admin-web.platform.hmcts.net" -> "admin-sds.hearings.reform.hmcts.net" # forces replacement
      ~ id              = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/sds-platform-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-shutter-vh-admin-web/endpoints/hmcts-vh-admin-web-shutter-prod/customDomains/vh-admin-web-platform-hmcts-net" -> (known after apply)
      ~ name            = "vh-admin-web-platform-hmcts-net" -> "admin-sds-hearings-reform-hmcts-net" # forces replacement
    }

  # module.shutter.azurerm_cdn_endpoint_custom_domain.this["vh-test-web"] will be destroyed
  - resource "azurerm_cdn_endpoint_custom_domain" "this" {
      - cdn_endpoint_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/sds-platform-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-shutter-vh-test-web/endpoints/hmcts-vh-test-web-shutter-prod" -> null
      - host_name       = "vh-test-web.platform.hmcts.net" -> null
      - id              = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/sds-platform-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-shutter-vh-test-web/endpoints/hmcts-vh-test-web-shutter-prod/customDomains/vh-test-web-platform-hmcts-net" -> null
      - name            = "vh-test-web-platform-hmcts-net" -> null
    }

  # module.shutter.azurerm_cdn_endpoint_custom_domain.this["vh-video-web"] must be replaced
-/+ resource "azurerm_cdn_endpoint_custom_domain" "this" {
      ~ cdn_endpoint_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/sds-platform-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-shutter-vh-video-web/endpoints/hmcts-vh-video-web-shutter-prod" -> (known after apply) # forces replacement
      ~ host_name       = "vh-video-web.platform.hmcts.net" -> "video-sds.hearings.reform.hmcts.net" # forces replacement
      ~ id              = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/sds-platform-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-shutter-vh-video-web/endpoints/hmcts-vh-video-web-shutter-prod/customDomains/vh-video-web-platform-hmcts-net" -> (known after apply)
      ~ name            = "vh-video-web-platform-hmcts-net" -> "video-sds-hearings-reform-hmcts-net" # forces replacement
    }

  # module.shutter.azurerm_cdn_profile.main["vh-test-web"] will be destroyed
  - resource "azurerm_cdn_profile" "main" {
      - id                  = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/sds-platform-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-shutter-vh-test-web" -> null
      - location            = "westus" -> null
      - name                = "hmcts-shutter-vh-test-web" -> null
      - resource_group_name = "sds-platform-prod-rg" -> null
      - sku                 = "Standard_Verizon" -> null
      - tags                = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/sds-azure-platform"
          - "businessArea" = "Cross-Cutting"
          - "criticality"  = "High"
          - "environment"  = "production"
        } -> null
    }

  # module.shutter.azurerm_cdn_profile.main["vh-wowza"] will be destroyed
  - resource "azurerm_cdn_profile" "main" {
      - id                  = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/sds-platform-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-shutter-vh-wowza" -> null
      - location            = "westus" -> null
      - name                = "hmcts-shutter-vh-wowza" -> null
      - resource_group_name = "sds-platform-prod-rg" -> null
      - sku                 = "Standard_Verizon" -> null
      - tags                = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/sds-azure-platform"
          - "businessArea" = "Cross-Cutting"
          - "criticality"  = "High"
          - "environment"  = "production"
        } -> null
    }

  # module.shutter.azurerm_storage_account.shutter_store["vh-test-web"] will be destroyed
  - resource "azurerm_storage_account" "shutter_store" {
      - access_tier                       = "Hot" -> null
      - account_kind                      = "StorageV2" -> null
      - account_replication_type          = "RAGRS" -> null
      - account_tier                      = "Standard" -> null
      - allow_nested_items_to_be_public   = true -> null
      - cross_tenant_replication_enabled  = true -> null
      - default_to_oauth_authentication   = false -> null
      - enable_https_traffic_only         = true -> null
      - id                                = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/sds-platform-prod-rg/providers/Microsoft.Storage/storageAccounts/hmctsvhtestweshutterprod" -> null
      - infrastructure_encryption_enabled = false -> null
      - is_hns_enabled                    = false -> null
      - location                          = "uksouth" -> null
      - min_tls_version                   = "TLS1_2" -> null
      - name                              = "hmctsvhtestweshutterprod" -> null
      - nfsv3_enabled                     = false -> null
      - primary_access_key                = (sensitive value)
      - primary_blob_connection_string    = (sensitive value)
      - primary_blob_endpoint             = "https://hmctsvhtestweshutterprod.blob.core.windows.net/" -> null
      - primary_blob_host                 = "hmctsvhtestweshutterprod.blob.core.windows.net" -> null
      - primary_connection_string         = (sensitive value)
      - primary_dfs_endpoint              = "https://hmctsvhtestweshutterprod.dfs.core.windows.net/" -> null
      - primary_dfs_host                  = "hmctsvhtestweshutterprod.dfs.core.windows.net" -> null
      - primary_file_endpoint             = "https://hmctsvhtestweshutterprod.file.core.windows.net/" -> null
      - primary_file_host                 = "hmctsvhtestweshutterprod.file.core.windows.net" -> null
      - primary_location                  = "uksouth" -> null
      - primary_queue_endpoint            = "https://hmctsvhtestweshutterprod.queue.core.windows.net/" -> null
      - primary_queue_host                = "hmctsvhtestweshutterprod.queue.core.windows.net" -> null
      - primary_table_endpoint            = "https://hmctsvhtestweshutterprod.table.core.windows.net/" -> null
      - primary_table_host                = "hmctsvhtestweshutterprod.table.core.windows.net" -> null
      - primary_web_endpoint              = "https://hmctsvhtestweshutterprod.z33.web.core.windows.net/" -> null
      - primary_web_host                  = "hmctsvhtestweshutterprod.z33.web.core.windows.net" -> null
      - public_network_access_enabled     = true -> null
      - queue_encryption_key_type         = "Service" -> null
      - resource_group_name               = "sds-platform-prod-rg" -> null
      - secondary_access_key              = (sensitive value)
      - secondary_blob_connection_string  = (sensitive value)
      - secondary_blob_endpoint           = "https://hmctsvhtestweshutterprod-secondary.blob.core.windows.net/" -> null
      - secondary_blob_host               = "hmctsvhtestweshutterprod-secondary.blob.core.windows.net" -> null
      - secondary_connection_string       = (sensitive value)
      - secondary_dfs_endpoint            = "https://hmctsvhtestweshutterprod-secondary.dfs.core.windows.net/" -> null
      - secondary_dfs_host                = "hmctsvhtestweshutterprod-secondary.dfs.core.windows.net" -> null
      - secondary_location                = "ukwest" -> null
      - secondary_queue_endpoint          = "https://hmctsvhtestweshutterprod-secondary.queue.core.windows.net/" -> null
      - secondary_queue_host              = "hmctsvhtestweshutterprod-secondary.queue.core.windows.net" -> null
      - secondary_table_endpoint          = "https://hmctsvhtestweshutterprod-secondary.table.core.windows.net/" -> null
      - secondary_table_host              = "hmctsvhtestweshutterprod-secondary.table.core.windows.net" -> null
      - secondary_web_endpoint            = "https://hmctsvhtestweshutterprod-secondary.z33.web.core.windows.net/" -> null
      - secondary_web_host                = "hmctsvhtestweshutterprod-secondary.z33.web.core.windows.net" -> null
      - shared_access_key_enabled         = true -> null
      - table_encryption_key_type         = "Service" -> null
      - tags                              = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/sds-azure-platform"
          - "businessArea" = "Cross-Cutting"
          - "criticality"  = "High"
          - "environment"  = "production"
        } -> null

      - blob_properties {
          - change_feed_enabled           = false -> null
          - change_feed_retention_in_days = 0 -> null
          - last_access_time_enabled      = false -> null
          - versioning_enabled            = false -> null
        }

      - network_rules {
          - bypass                     = [
              - "AzureServices",
            ] -> null
          - default_action             = "Allow" -> null
          - ip_rules                   = [] -> null
          - virtual_network_subnet_ids = [] -> null
        }

      - queue_properties {

          - hour_metrics {
              - enabled               = true -> null
              - include_apis          = true -> null
              - retention_policy_days = 7 -> null
              - version               = "1.0" -> null
            }

          - logging {
              - delete                = false -> null
              - read                  = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
              - write                 = false -> null
            }

          - minute_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
        }

      - share_properties {

          - retention_policy {
              - days = 7 -> null
            }
        }

      - static_website {
          - error_404_document = "index.html" -> null
          - index_document     = "index.html" -> null
        }
    }

  # module.shutter.azurerm_storage_account.shutter_store["vh-wowza"] will be destroyed
  - resource "azurerm_storage_account" "shutter_store" {
      - access_tier                       = "Hot" -> null
      - account_kind                      = "StorageV2" -> null
      - account_replication_type          = "RAGRS" -> null
      - account_tier                      = "Standard" -> null
      - allow_nested_items_to_be_public   = true -> null
      - cross_tenant_replication_enabled  = true -> null
      - default_to_oauth_authentication   = false -> null
      - enable_https_traffic_only         = true -> null
      - id                                = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/sds-platform-prod-rg/providers/Microsoft.Storage/storageAccounts/hmctsvhwowzashutterprod" -> null
      - infrastructure_encryption_enabled = false -> null
      - is_hns_enabled                    = false -> null
      - location                          = "uksouth" -> null
      - min_tls_version                   = "TLS1_2" -> null
      - name                              = "hmctsvhwowzashutterprod" -> null
      - nfsv3_enabled                     = false -> null
      - primary_access_key                = (sensitive value)
      - primary_blob_connection_string    = (sensitive value)
      - primary_blob_endpoint             = "https://hmctsvhwowzashutterprod.blob.core.windows.net/" -> null
      - primary_blob_host                 = "hmctsvhwowzashutterprod.blob.core.windows.net" -> null
      - primary_connection_string         = (sensitive value)
      - primary_dfs_endpoint              = "https://hmctsvhwowzashutterprod.dfs.core.windows.net/" -> null
      - primary_dfs_host                  = "hmctsvhwowzashutterprod.dfs.core.windows.net" -> null
      - primary_file_endpoint             = "https://hmctsvhwowzashutterprod.file.core.windows.net/" -> null
      - primary_file_host                 = "hmctsvhwowzashutterprod.file.core.windows.net" -> null
      - primary_location                  = "uksouth" -> null
      - primary_queue_endpoint            = "https://hmctsvhwowzashutterprod.queue.core.windows.net/" -> null
      - primary_queue_host                = "hmctsvhwowzashutterprod.queue.core.windows.net" -> null
      - primary_table_endpoint            = "https://hmctsvhwowzashutterprod.table.core.windows.net/" -> null
      - primary_table_host                = "hmctsvhwowzashutterprod.table.core.windows.net" -> null
      - primary_web_endpoint              = "https://hmctsvhwowzashutterprod.z33.web.core.windows.net/" -> null
      - primary_web_host                  = "hmctsvhwowzashutterprod.z33.web.core.windows.net" -> null
      - public_network_access_enabled     = true -> null
      - queue_encryption_key_type         = "Service" -> null
      - resource_group_name               = "sds-platform-prod-rg" -> null
      - secondary_access_key              = (sensitive value)
      - secondary_blob_connection_string  = (sensitive value)
      - secondary_blob_endpoint           = "https://hmctsvhwowzashutterprod-secondary.blob.core.windows.net/" -> null
      - secondary_blob_host               = "hmctsvhwowzashutterprod-secondary.blob.core.windows.net" -> null
      - secondary_connection_string       = (sensitive value)
      - secondary_dfs_endpoint            = "https://hmctsvhwowzashutterprod-secondary.dfs.core.windows.net/" -> null
      - secondary_dfs_host                = "hmctsvhwowzashutterprod-secondary.dfs.core.windows.net" -> null
      - secondary_location                = "ukwest" -> null
      - secondary_queue_endpoint          = "https://hmctsvhwowzashutterprod-secondary.queue.core.windows.net/" -> null
      - secondary_queue_host              = "hmctsvhwowzashutterprod-secondary.queue.core.windows.net" -> null
      - secondary_table_endpoint          = "https://hmctsvhwowzashutterprod-secondary.table.core.windows.net/" -> null
      - secondary_table_host              = "hmctsvhwowzashutterprod-secondary.table.core.windows.net" -> null
      - secondary_web_endpoint            = "https://hmctsvhwowzashutterprod-secondary.z33.web.core.windows.net/" -> null
      - secondary_web_host                = "hmctsvhwowzashutterprod-secondary.z33.web.core.windows.net" -> null
      - shared_access_key_enabled         = true -> null
      - table_encryption_key_type         = "Service" -> null
      - tags                              = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/sds-azure-platform"
          - "businessArea" = "Cross-Cutting"
          - "criticality"  = "High"
          - "environment"  = "production"
        } -> null

      - blob_properties {
          - change_feed_enabled           = false -> null
          - change_feed_retention_in_days = 0 -> null
          - last_access_time_enabled      = false -> null
          - versioning_enabled            = false -> null
        }

      - network_rules {
          - bypass                     = [
              - "AzureServices",
            ] -> null
          - default_action             = "Allow" -> null
          - ip_rules                   = [] -> null
          - virtual_network_subnet_ids = [] -> null
        }

      - queue_properties {

          - hour_metrics {
              - enabled               = true -> null
              - include_apis          = true -> null
              - retention_policy_days = 7 -> null
              - version               = "1.0" -> null
            }

          - logging {
              - delete                = false -> null
              - read                  = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
              - write                 = false -> null
            }

          - minute_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
        }

      - share_properties {

          - retention_policy {
              - days = 7 -> null
            }
        }

      - static_website {
          - error_404_document = "index.html" -> null
          - index_document     = "index.html" -> null
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["court-tribunal-hearings"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "529ffe0914df4e33b9ea640cd35daefc"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["jd-bureau"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "aa5da691ac7f468bb597203bc30de7a2"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["jd-reply-jury-summons"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "551ff849e47d44c19c805e710a2b0c22"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["pip-frontend"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "529ffe0914df4e33b9ea640cd35daefc"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["sds-api-mgmt"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "529ffe0914df4e33b9ea640cd35daefc"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["vh-admin-web"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "9f24761682764ad8a98bcda56cef810f"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["vh-video-web"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "9f24761682764ad8a98bcda56cef810f"
        }
    }

Plan: 11 to add, 0 to change, 11 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":319,"Program":"tfcmt","SHA1":"","Target":"prod-shutter","Vars":{}} -->